src/cf/Catalogs/ВнутренниеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ВнутренниеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВнутренниеДокументы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтметитьОбязательныеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	ОтметитьОбязательныеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьОбязательныеПоля()                    
	Если ПроверитьЯвляетсяДоговором() Тогда
	  Элементы.Контрагент.ОтметкаНезаполненного = Истина;
	  Элементы.КонтактноеЛицоКонтрагента.ОтметкаНезаполненного = Истина;
	Иначе
	  Элементы.Контрагент.ОтметкаНезаполненного = Ложь;
	  Элементы.КонтактноеЛицоКонтрагента.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьЯвляетсяДоговором()
	Возврат Объект.Вид.ЯвлеяетсяДоговором
КонецФункции
